{"class_name": "Model", "config": {"name": "model_5", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 82, 64, 32, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"name": "time_distributed_3", "class_name": "TimeDistributed", "config": {"name": "time_distributed_3", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"name": "time_distributed_9", "class_name": "TimeDistributed", "config": {"name": "time_distributed_9", "trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]]}, {"name": "time_distributed_10", "class_name": "TimeDistributed", "config": {"name": "time_distributed_10", "trainable": true, "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}}, "inbound_nodes": [[["time_distributed_9", 0, 0, {}]]]}, {"name": "time_distributed_11", "class_name": "TimeDistributed", "config": {"name": "time_distributed_11", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_10", 0, 0, {}]]]}, {"name": "time_distributed_13", "class_name": "TimeDistributed", "config": {"name": "time_distributed_13", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_11", 0, 0, {}]]]}, {"name": "time_distributed_14", "class_name": "TimeDistributed", "config": {"name": "time_distributed_14", "trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}}, "inbound_nodes": [[["time_distributed_13", 0, 0, {}]]]}, {"name": "time_distributed_15", "class_name": "TimeDistributed", "config": {"name": "time_distributed_15", "trainable": true, "layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}}, "inbound_nodes": [[["time_distributed_14", 0, 0, {}]]]}, {"name": "time_distributed_16", "class_name": "TimeDistributed", "config": {"name": "time_distributed_16", "trainable": true, "layer": {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}}, "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]]}, {"name": "time_distributed_17", "class_name": "TimeDistributed", "config": {"name": "time_distributed_17", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]]}, {"name": "bidirectional_2", "class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"name": "bidirectional_3", "class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"name": "labels", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "labels"}, "inbound_nodes": []}, {"name": "input_length", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_length"}, "inbound_nodes": []}, {"name": "label_length", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "label_length"}, "inbound_nodes": []}, {"name": "CTCanalysis", "class_name": "Lambda", "config": {"name": "CTCanalysis", "trainable": true, "function": ["4wEAAAAAAAAAEQAAAAYAAABLAAAAc+oAAAB8AFwEfQJ9A30EfQV8AX0GdABqAYMAZAFrAnMgdAKC\nAXQDagR0A2oFfAJkAmQDZARnA2QFjQJkBhcAgwF9B3QDagZ0A2oHfASDAXQDagiDAn0EfAZkBxkA\nfQh8BmQIGQB9CXwGZAkZAH0KfAhygnQJagp8B3wEZAqNAlwCfQt9DG4WdAlqC3wHfAR8CXwKZAuN\nBFwCfQt9DHQDagZ8C2QDGQB0A2oMgwJ9DXQAag18A3QDagZ0A2oHfAWDAXQDagiDAoMCfQ50DnwN\nfA5kDGQNjQN9D3QPfA+DAX0QdABqBnwQZA5kD40CUwApEOEnAQAACiAgICAgICAgQ29tcGxldGUg\nQ1RDIGFuYWx5c2lzIHVzaW5nIEtlcmFzIGFuZCB0ZW5zb3JmbG93CiAgICAgICAgV0FSTklORyA6\nIHRmIGlzIHJlcXVpcmVkIAogICAgICAgIDpwYXJhbSBhcmdzOiAKICAgICAgICAgICAgeV9wcmVk\nLCBsYWJlbHMsIGlucHV0X2xlbmd0aCwgbGFiZWxfbGVuCiAgICAgICAgOnBhcmFtIGFyZ3VtZW50\nczoKICAgICAgICAgICAgZ3JlZWR5LCBiZWFtX3dpZHRoLCB0b3BfcGF0aHMKICAgICAgICA6cmV0\ndXJuOiAKICAgICAgICAgICAgbGVyID0gbGFiZWwgZXJyb3IgcmF0ZQogICAgICAgINoKdGVuc29y\nZmxvd+kBAAAA6QAAAADpAgAAACkB2gRwZXJtZzqMMOKOeUU+2gZncmVlZHnaCmJlYW1fd2lkdGja\nCXRvcF9wYXRocykC2gZpbnB1dHPaD3NlcXVlbmNlX2xlbmd0aCkEcgoAAAByCwAAAHIIAAAAcgkA\nAABUKQHaBG5vcm3aB2Zsb2F0MzIpAdoFZHR5cGUpENoBS9oHYmFja2VuZNoOQXNzZXJ0aW9uRXJy\nb3LaAnRm2gNsb2faCXRyYW5zcG9zZdoEY2FzdNoHc3F1ZWV6ZdoFaW50MzLaA2N0Y9oSY3RjX2dy\nZWVkeV9kZWNvZGVy2hdjdGNfYmVhbV9zZWFyY2hfZGVjb2RlcnINAAAA2hljdGNfbGFiZWxfZGVu\nc2VfdG9fc3BhcnNl2hB0Zl9lZGl0X2Rpc3RhbmNl2g1LcmVzaGFwZV9UbzFEKRHaBGFyZ3PaCWFy\nZ3VtZW50c9oGeV9wcmVk2gZsYWJlbHPaDGlucHV0X2xlbmd0aNoJbGFiZWxfbGVu2glteV9wYXJh\nbXPaBWJhdGNocgcAAAByCAAAAHIJAAAA2gdkZWNvZGVk2ghsb2dfcHJvYloMY2FzdF9kZWNvZGVk\nWghzcGFyc2VfeVoJZWRfdGVuc29yWgtsZXJfcGVyX3NlcakAcigAAAD6JS9Vc2Vycy9kZXRoL0Rl\nc2t0b3AvYXJ2aW4vQ1RDTW9kZWwucHnaIWN0Y19jb21wbGV0ZV9hbmFseXNpc19sYW1iZGFfZnVu\nY2kDAABzKAAAAAAPDAEEAhACHgIUAggBCAEIAgQBBAECAQ4CBAEEAQ4CEgIcAQ4BCAI=\n", null, null], "function_type": "lambda", "output_shape": [null], "output_shape_type": "raw", "arguments": {"greedy": true, "beam_width": 100, "top_paths": 1}}, "inbound_nodes": [[["bidirectional_3", 0, 0, {}], ["labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "output_layers": [["CTCanalysis", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}